AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Период_взаимодействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СвязанныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Платежное_поручение_исход</v8:Type>
						<v8:Type>cfg:DocumentRef.Заявка_на_расходование_ДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланируемоеПоступлениеДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление_товаров_и_услуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Поступление_товаров_и_услуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>Поступление_товаров_и_услуг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата_поступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список_товаров_и_услуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Виды_номенкулатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товары</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенкулатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/Пробник/Ext/Module.bsl
Функция ПолучитьСписок () Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	Организации.Ссылка
	                |ИЗ
	                |	Справочник.Организации КАК Организации
	                |ГДЕ
	                |	Организации.Код = &Код";
	Запрос.УстановитьПараметр("Код", "000000000000001");
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции

Функция ОбновитьДанныеДокумента(ОбъектОснование, ДокументПриёмник)  Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Поступление_товаров_и_услуг.Ссылка,
		|	Поступление_товаров_и_услуг.Организация,
		|	Поступление_товаров_и_услуг.Дата_поступления,
		|	Поступление_товаров_и_услуг.Сумма,
		|	Поступление_товаров_и_услуг.Контрагент
		|ИЗ
		|	Документ.Поступление_товаров_и_услуг КАК Поступление_товаров_и_услуг
		|ГДЕ
		|	Поступление_товаров_и_услуг.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",ОбъектОснование);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Структура = Новый Структура;
			Структура.Вставить("Организация", Выборка.Организация);
			Структура.Вставить("Дата_поступления", Выборка.Дата_поступления);
			Структура.Вставить("Сумма", Выборка.Сумма);
			Структура.Вставить("Контрагент", Выборка.Контрагент);
			
			Если ТипЗнч(ДокументПриёмник) = Тип("ДокументСсылка.Платежное_поручение_исход")	Тогда	
				Структура.Вставить("ПоступлениеТиУ", Выборка.Ссылка);	
			КонецЕсли;
			
		КонецЕсли;
			
		Возврат Структура
		
	КонецФункции

Функция КонтрольСуммыЗадолженности(Контрагент, ДокументОснование) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат	Неопределено 
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПокупателя") тогда
		ЗнакСравнения = ">";
	Иначе    
		ЗнакСравнения = "<";		 
	КонецЕсли;
	
	Запрос = Новый запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(Взаиморасчеты_с_контрагентамиОстаткиИОбороты.СуммаОборот) КАК Обороты
	|ПОМЕСТИТЬ ВТ_СуммаОборот
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|			,
	|			,
	|			Авто,
	|			,
	|			Контрагент = &Контрагент
	|				И ДокументОснование = &ДокументОснование) КАК Взаиморасчеты_с_контрагентамиОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_СуммаОборот.Обороты "+ЗнакСравнения+" 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БольшеНуля
	|ИЗ
	|	ВТ_СуммаОборот КАК ВТ_СуммаОборот";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить();
			
	Выборка = РезультатЗапроса.Выбрать(); 
	Выборка.Следующий(); 
	Возврат Выборка.БольшеНуля //Выборка.СуммаОборот
	
КонецФункции
	
Функция ЗаписьДанныхВРегистр(СтркутураДляЗаполнения,ОсновнойДокумент) Экспорт
	
	НаборДанных = РегистрыСведений.СвязанныеДокументы.СоздатьНаборЗаписей();
	НаборДанных.Отбор.ОсновнойДокумент.Установить(ОсновнойДокумент);
	НаборДанных.Отбор.СвязанныйДокумент.Установить(СтркутураДляЗаполнения.СвязанныйДокумент);
	НоваяЗапись = НаборДанных.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтркутураДляЗаполнения);
	НаборДанных.Записать(Истина);
	
КонецФункции

Функция  ПолучитьСвязанныеДокументыНаСервере(ОсновнойДокумент, ИсходныйДокумент = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязанныеДокументы.СвязанныйДокумент
	|ИЗ
	|	РегистрСведений.СвязанныеДокументы КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.ОсновнойДокумент = &ОсновнойДокумент";
	
	Запрос.УстановитьПараметр("ОсновнойДокумент", ОсновнойДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не  РезультатЗапроса.Пустой() тогда
			
		Выборка = РезультатЗапроса.Выбрать();
		
		Массив  = новый массив;
		
		Пока Выборка.Следующий() цикл
			
			Массив.Добавить(Выборка.СвязанныйДокумент);
			
		КонецЦикла;
		
		Если ИсходныйДокумент = Неопределено Тогда
			ИсходныйДокумент = ОсновнойДокумент;
		КонецЕсли;
			
		Возврат СформироватьМакет(Массив, ИсходныйДокумент, ОсновнойДокумент)
		
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции

Функция СформироватьМакет (МассивДокументов, Исходник, ОсновнойДокумент) Экспорт
	
	Макет = ПолучитьОбщийМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьОсновнойДокумент = Макет.ПолучитьОбласть("ОбластьОсновнойДокумент");
	ОбластьПодчинённыйДокумент = Макет.ПолучитьОбласть("ОбластьПодчинённыйДокумент");
	
	Макет.Очистить();
	
	Если МассивДокументов = Неопределено тогда
		Возврат Неопределено
	КонецЕсли;
	
	ОбластьШапка.Параметры.ИсходныйДокумент = Исходник;
	ОбластьОсновнойДокумент.Параметры.ДокументОснование  =  ОсновнойДокумент;
	Макет.Вывести(ОбластьШапка);
	Макет.Вывести(ОбластьОсновнойДокумент);
	
	Для каждого СтрокаМассива из МассивДокументов цикл 
		
		ОбластьПодчинённыйДокумент.Параметры.ПодчинённыйДокумент =  СтрокаМассива;
		Макет.Вывести(ОбластьПодчинённыйДокумент);
		
	КонецЦикла;
	
	Возврат	Макет

КонецФункции
